[
  {
    "id": "1",
    "leeftype": "Boombewoners",
    "description": "Deze groep omvat spinnen die voornamelijk in bomen leven, met een voorkeur voor dichte, boomrijke bossen.",
    "habitat": "Boomrijke bossen",
    "temperatuur": "Gematigd",
    "vochtigheid": "Hoog",
    "voeding": "Insecten en kleine ongewervelden",
    "bedreiging": "Laag",
    "text": "Boombewoners spinnen leven in de hoge takken en onder het dichte bladerdak van bossen. Ze hebben zich uitstekend aangepast aan een leven hoog in de bomen, waar ze hun behendigheid en camouflage gebruiken om roofdieren te ontwijken en prooien te besluipen. De complexe structuur van de boomkruinen biedt hen een overvloed aan schuilplaatsen en voedselbronnen.",
    "imageUrl": "https://raw.githubusercontent.com/PiotrMx3/imagesWebOntwikkeling/refs/heads/main/images/arboreal.jpg"
  },
  {
    "id": "2",
    "leeftype": "Bodembewoners",
    "description": "Deze groep omvat spinnen die op de grond leven en vaak holen of nissen graven als onderkomen.",
    "habitat": "Graslanden en woestijnen",
    "temperatuur": "Warm",
    "vochtigheid": "Variabel",
    "voeding": "Insecten en kleine dieren",
    "bedreiging": "Variabel",
    "text": "Bodembewoners spinnen leven op de grond en maken vaak gebruik van holen of natuurlijke schuilplaatsen. Ze zijn bedreven in het besluipen van prooien op de open vlakte of in rotsachtige omgevingen. Hun vermogen tot camouflage en snelle beweging helpt hen overleven in wisselende omstandigheden, van warme woestijngebieden tot gematigde graslanden.",
    "imageUrl": "https://raw.githubusercontent.com/PiotrMx3/imagesWebOntwikkeling/refs/heads/main/images/terrestrial.jpg"
  },
  {
    "id": "3",
    "leeftype": "Ondergronds levend",
    "description": "Deze groep omvat spinnen die ondergronds leven, vaak in tunnels of holen, met een constante omgeving.",
    "habitat": "Subterrane omgevingen",
    "temperatuur": "Constante",
    "vochtigheid": "Hoog",
    "voeding": "Insecten",
    "bedreiging": "Laag",
    "text": "Ondergronds levend spinnen hebben zich gespecialiseerd in het leven onder de grond, waar de temperatuur en vochtigheid constant blijven. Ze graven uitgebreide tunnels en holen, die dienen als veilige schuilplaatsen tegen roofdieren en extreme weersomstandigheden. Deze spinnen maken efficiënt gebruik van hun omgeving door prooien te lokaliseren in de schaduwrijke en vochtige omstandigheden van de ondergrond.",
    "imageUrl": "https://raw.githubusercontent.com/PiotrMx3/imagesWebOntwikkeling/refs/heads/main/images/fossorial.jpg"
  }
]
